#include <stdio.h>

int main(void)
{ int v[13]; 
  int i;
  int a,b,c;
  	printf("请输入格式为xxxx/x/x的日期：");
	do{
	scanf("%d/%d/%d",&a,&b,&c); 
	if(a<0||b<1||b>12||c>31||c<1)
	printf("您输入的数值不合法，请重新输入：");
	}
	while(a<0||b<1||b>12||c>12||c<1) ; 
	if(a%4==0){
		v[0]=0; v[1]=31;v[2]=29;v[3]=31;v[4]=30;v[5]=31;v[6]=30;v[7]=31;v[8]=31;v[9]=30;v[10]=31;v[11]=30;v[12]=31;
	}
	if(a%4!=0){
			v[0]=0; v[1]=31;v[2]=28;v[3]=31;v[4]=30;v[5]=31;v[6]=30;v[7]=31;v[8]=31;v[9]=30;v[10]=31;v[11]=30;v[12]=31;
	}
	for(i=0;i<b;i++){
		c+=v[i];
	} 
	printf("这是该年的第%d天",c);
  return 0;
}
